backend/load-test/results/2026-09-23-dev-onboarding/ramp-single-high.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/onboarding-signup-ramp.js
        output: -

     scenarios: (100.00%) 1 scenario, 600 max VUs, 5m0s max duration (incl. graceful stop):
              * signup: Up to 26.67 iterations/s for 4m30s over 5 stages (maxVUs: 200-600, exec: signupJourney, gracefulStop: 30s)

time="2026-09-23T18:19:41+09:00" level=info msg="signup ramp: 600/min@1m → 900/min@1m → 1200/min@1m → 1600/min@1m · 계정 9000개(offset 3200) · 필요 약 4300" source=console

running (0m01.0s), 009/200 VUs, 0 complete and 0 interrupted iterations
signup   [   0% ] 009/200 VUs  0m01.0s/4m30s  10.00 iters/s

running (0m02.0s), 019/200 VUs, 0 complete and 0 interrupted iterations
signup   [   1% ] 019/200 VUs  0m02.0s/4m30s  10.00 iters/s

running (0m03.0s), 029/200 VUs, 0 complete and 0 interrupted iterations
signup   [   1% ] 029/200 VUs  0m03.0s/4m30s  10.00 iters/s

running (0m04.0s), 039/200 VUs, 0 complete and 0 interrupted iterations
signup   [   1% ] 039/200 VUs  0m04.0s/4m30s  10.00 iters/s

running (0m05.0s), 049/200 VUs, 0 complete and 0 interrupted iterations
signup   [   2% ] 049/200 VUs  0m05.0s/4m30s  10.00 iters/s

running (0m06.0s), 059/200 VUs, 0 complete and 0 interrupted iterations
signup   [   2% ] 059/200 VUs  0m06.0s/4m30s  10.00 iters/s

running (0m07.0s), 069/200 VUs, 0 complete and 0 interrupted iterations
signup   [   3% ] 069/200 VUs  0m07.0s/4m30s  10.00 iters/s

running (0m08.0s), 079/200 VUs, 0 complete and 0 interrupted iterations
signup   [   3% ] 079/200 VUs  0m08.0s/4m30s  10.00 iters/s

running (0m09.0s), 089/200 VUs, 0 complete and 0 interrupted iterations
signup   [   3% ] 089/200 VUs  0m09.0s/4m30s  10.00 iters/s

running (0m10.0s), 097/200 VUs, 2 complete and 0 interrupted iterations
signup   [   4% ] 097/200 VUs  0m10.0s/4m30s  10.00 iters/s

running (0m11.0s), 105/200 VUs, 4 complete and 0 interrupted iterations
signup   [   4% ] 105/200 VUs  0m11.0s/4m30s  10.00 iters/s

running (0m12.0s), 107/200 VUs, 12 complete and 0 interrupted iterations
signup   [   4% ] 107/200 VUs  0m12.0s/4m30s  10.00 iters/s

running (0m13.0s), 110/200 VUs, 19 complete and 0 interrupted iterations
signup   [   5% ] 110/200 VUs  0m13.0s/4m30s  10.00 iters/s

running (0m14.0s), 114/200 VUs, 25 complete and 0 interrupted iterations
signup   [   5% ] 114/200 VUs  0m14.0s/4m30s  10.00 iters/s

running (0m15.0s), 112/200 VUs, 37 complete and 0 interrupted iterations
signup   [   6% ] 112/200 VUs  0m15.0s/4m30s  10.00 iters/s

running (0m16.0s), 112/200 VUs, 47 complete and 0 interrupted iterations
signup   [   6% ] 112/200 VUs  0m16.0s/4m30s  10.00 iters/s

running (0m17.0s), 113/200 VUs, 56 complete and 0 interrupted iterations
signup   [   6% ] 113/200 VUs  0m17.0s/4m30s  10.00 iters/s

running (0m18.0s), 117/200 VUs, 62 complete and 0 interrupted iterations
signup   [   7% ] 117/200 VUs  0m18.0s/4m30s  10.00 iters/s

running (0m19.0s), 118/200 VUs, 71 complete and 0 interrupted iterations
signup   [   7% ] 118/200 VUs  0m19.0s/4m30s  10.00 iters/s

running (0m20.0s), 123/200 VUs, 76 complete and 0 interrupted iterations
signup   [   7% ] 123/200 VUs  0m20.0s/4m30s  10.00 iters/s

running (0m21.0s), 113/200 VUs, 96 complete and 0 interrupted iterations
signup   [   8% ] 113/200 VUs  0m21.0s/4m30s  10.00 iters/s

running (0m22.0s), 114/200 VUs, 105 complete and 0 interrupted iterations
signup   [   8% ] 114/200 VUs  0m22.0s/4m30s  10.00 iters/s

running (0m23.0s), 115/200 VUs, 114 complete and 0 interrupted iterations
signup   [   9% ] 115/200 VUs  0m23.0s/4m30s  10.00 iters/s

running (0m24.0s), 115/200 VUs, 124 complete and 0 interrupted iterations
signup   [   9% ] 115/200 VUs  0m24.0s/4m30s  10.00 iters/s

running (0m25.0s), 111/200 VUs, 138 complete and 0 interrupted iterations
signup   [   9% ] 111/200 VUs  0m25.0s/4m30s  10.00 iters/s

running (0m26.0s), 111/200 VUs, 148 complete and 0 interrupted iterations
signup   [  10% ] 111/200 VUs  0m26.0s/4m30s  10.00 iters/s

running (0m27.0s), 109/200 VUs, 160 complete and 0 interrupted iterations
signup   [  10% ] 109/200 VUs  0m27.0s/4m30s  10.00 iters/s

running (0m28.0s), 111/200 VUs, 168 complete and 0 interrupted iterations
signup   [  10% ] 111/200 VUs  0m28.0s/4m30s  10.00 iters/s

running (0m29.0s), 111/200 VUs, 178 complete and 0 interrupted iterations
signup   [  11% ] 111/200 VUs  0m29.0s/4m30s  10.00 iters/s

running (0m30.0s), 110/200 VUs, 189 complete and 0 interrupted iterations
signup   [  11% ] 110/200 VUs  0m30.0s/4m30s  10.00 iters/s

running (0m31.0s), 110/200 VUs, 199 complete and 0 interrupted iterations
signup   [  11% ] 110/200 VUs  0m31.0s/4m30s  10.00 iters/s

running (0m32.0s), 111/200 VUs, 208 complete and 0 interrupted iterations
signup   [  12% ] 111/200 VUs  0m32.0s/4m30s  10.00 iters/s

running (0m33.0s), 114/200 VUs, 215 complete and 0 interrupted iterations
signup   [  12% ] 114/200 VUs  0m33.0s/4m30s  10.00 iters/s

running (0m34.0s), 116/200 VUs, 223 complete and 0 interrupted iterations
signup   [  13% ] 116/200 VUs  0m34.0s/4m30s  10.00 iters/s

running (0m35.0s), 116/200 VUs, 233 complete and 0 interrupted iterations
signup   [  13% ] 116/200 VUs  0m35.0s/4m30s  10.00 iters/s

running (0m36.0s), 114/200 VUs, 245 complete and 0 interrupted iterations
signup   [  13% ] 114/200 VUs  0m36.0s/4m30s  10.00 iters/s

running (0m37.0s), 112/200 VUs, 257 complete and 0 interrupted iterations
signup   [  14% ] 112/200 VUs  0m37.0s/4m30s  10.00 iters/s

running (0m38.0s), 110/200 VUs, 269 complete and 0 interrupted iterations
signup   [  14% ] 110/200 VUs  0m38.0s/4m30s  10.00 iters/s

running (0m39.0s), 112/200 VUs, 277 complete and 0 interrupted iterations
signup   [  14% ] 112/200 VUs  0m39.0s/4m30s  10.00 iters/s

running (0m40.0s), 110/200 VUs, 289 complete and 0 interrupted iterations
signup   [  15% ] 110/200 VUs  0m40.0s/4m30s  10.00 iters/s

running (0m41.0s), 109/200 VUs, 300 complete and 0 interrupted iterations
signup   [  15% ] 109/200 VUs  0m41.0s/4m30s  10.00 iters/s

running (0m42.0s), 112/200 VUs, 307 complete and 0 interrupted iterations
signup   [  16% ] 112/200 VUs  0m42.0s/4m30s  10.00 iters/s

running (0m43.0s), 110/200 VUs, 319 complete and 0 interrupted iterations
signup   [  16% ] 110/200 VUs  0m43.0s/4m30s  10.00 iters/s

running (0m44.0s), 109/200 VUs, 330 complete and 0 interrupted iterations
signup   [  16% ] 109/200 VUs  0m44.0s/4m30s  10.00 iters/s

running (0m45.0s), 110/200 VUs, 339 complete and 0 interrupted iterations
signup   [  17% ] 110/200 VUs  0m45.0s/4m30s  10.00 iters/s

running (0m46.0s), 110/200 VUs, 349 complete and 0 interrupted iterations
signup   [  17% ] 110/200 VUs  0m46.0s/4m30s  10.00 iters/s

running (0m47.0s), 110/200 VUs, 359 complete and 0 interrupted iterations
signup   [  17% ] 110/200 VUs  0m47.0s/4m30s  10.00 iters/s

running (0m48.0s), 108/200 VUs, 371 complete and 0 interrupted iterations
signup   [  18% ] 108/200 VUs  0m48.0s/4m30s  10.00 iters/s

running (0m49.0s), 107/200 VUs, 382 complete and 0 interrupted iterations
signup   [  18% ] 107/200 VUs  0m49.0s/4m30s  10.00 iters/s

running (0m50.0s), 107/200 VUs, 392 complete and 0 interrupted iterations
signup   [  19% ] 107/200 VUs  0m50.0s/4m30s  10.00 iters/s

running (0m51.0s), 109/200 VUs, 400 complete and 0 interrupted iterations
signup   [  19% ] 109/200 VUs  0m51.0s/4m30s  10.00 iters/s

running (0m52.0s), 108/200 VUs, 411 complete and 0 interrupted iterations
signup   [  19% ] 108/200 VUs  0m52.0s/4m30s  10.00 iters/s

running (0m53.0s), 109/200 VUs, 420 complete and 0 interrupted iterations
signup   [  20% ] 109/200 VUs  0m53.0s/4m30s  10.00 iters/s

running (0m54.0s), 112/200 VUs, 427 complete and 0 interrupted iterations
signup   [  20% ] 112/200 VUs  0m54.0s/4m30s  10.00 iters/s

running (0m55.0s), 111/200 VUs, 438 complete and 0 interrupted iterations
signup   [  20% ] 111/200 VUs  0m55.0s/4m30s  10.00 iters/s

running (0m56.0s), 107/200 VUs, 452 complete and 0 interrupted iterations
signup   [  21% ] 107/200 VUs  0m56.0s/4m30s  10.00 iters/s

running (0m57.0s), 107/200 VUs, 462 complete and 0 interrupted iterations
signup   [  21% ] 107/200 VUs  0m57.0s/4m30s  10.00 iters/s

running (0m58.0s), 110/200 VUs, 469 complete and 0 interrupted iterations
signup   [  21% ] 110/200 VUs  0m58.0s/4m30s  10.00 iters/s

running (0m59.0s), 114/200 VUs, 475 complete and 0 interrupted iterations
signup   [  22% ] 114/200 VUs  0m59.0s/4m30s  10.00 iters/s

running (1m00.0s), 110/200 VUs, 489 complete and 0 interrupted iterations
signup   [  22% ] 110/200 VUs  1m00.0s/4m30s  10.00 iters/s

running (1m01.0s), 112/200 VUs, 497 complete and 0 interrupted iterations
signup   [  23% ] 112/200 VUs  1m01.0s/4m30s  10.08 iters/s

running (1m02.0s), 112/200 VUs, 507 complete and 0 interrupted iterations
signup   [  23% ] 112/200 VUs  1m02.0s/4m30s  10.16 iters/s

running (1m03.0s), 118/200 VUs, 512 complete and 0 interrupted iterations
signup   [  23% ] 118/200 VUs  1m03.0s/4m30s  10.25 iters/s

running (1m04.0s), 113/200 VUs, 527 complete and 0 interrupted iterations
signup   [  24% ] 113/200 VUs  1m04.0s/4m30s  10.33 iters/s

running (1m05.0s), 110/200 VUs, 540 complete and 0 interrupted iterations
signup   [  24% ] 110/200 VUs  1m05.0s/4m30s  10.41 iters/s

running (1m06.0s), 110/200 VUs, 551 complete and 0 interrupted iterations
signup   [  24% ] 110/200 VUs  1m06.0s/4m30s  10.50 iters/s

running (1m07.0s), 110/200 VUs, 561 complete and 0 interrupted iterations
signup   [  25% ] 110/200 VUs  1m07.0s/4m30s  10.58 iters/s

running (1m08.0s), 111/200 VUs, 571 complete and 0 interrupted iterations
signup   [  25% ] 111/200 VUs  1m08.0s/4m30s  10.67 iters/s

running (1m09.0s), 116/200 VUs, 577 complete and 0 interrupted iterations
signup   [  26% ] 116/200 VUs  1m09.0s/4m30s  10.75 iters/s

running (1m10.0s), 118/200 VUs, 585 complete and 0 interrupted iterations
signup   [  26% ] 118/200 VUs  1m10.0s/4m30s  10.83 iters/s

running (1m11.0s), 117/200 VUs, 597 complete and 0 interrupted iterations
signup   [  26% ] 117/200 VUs  1m11.0s/4m30s  10.91 iters/s

running (1m12.0s), 115/200 VUs, 610 complete and 0 interrupted iterations
signup   [  27% ] 115/200 VUs  1m12.0s/4m30s  11.00 iters/s

running (1m13.0s), 119/200 VUs, 617 complete and 0 interrupted iterations
signup   [  27% ] 119/200 VUs  1m13.0s/4m30s  11.08 iters/s

running (1m14.0s), 116/200 VUs, 631 complete and 0 interrupted iterations
signup   [  27% ] 116/200 VUs  1m14.0s/4m30s  11.16 iters/s

running (1m15.0s), 121/200 VUs, 638 complete and 0 interrupted iterations
signup   [  28% ] 121/200 VUs  1m15.0s/4m30s  11.25 iters/s

running (1m16.0s), 119/200 VUs, 651 complete and 0 interrupted iterations
signup   [  28% ] 119/200 VUs  1m16.0s/4m30s  11.33 iters/s

running (1m17.0s), 118/200 VUs, 663 complete and 0 interrupted iterations
signup   [  29% ] 118/200 VUs  1m17.0s/4m30s  11.41 iters/s

running (1m18.0s), 122/200 VUs, 671 complete and 0 interrupted iterations
signup   [  29% ] 122/200 VUs  1m18.0s/4m30s  11.50 iters/s

running (1m19.0s), 125/200 VUs, 679 complete and 0 interrupted iterations
signup   [  29% ] 125/200 VUs  1m19.0s/4m30s  11.58 iters/s

running (1m20.0s), 129/200 VUs, 687 complete and 0 interrupted iterations
signup   [  30% ] 129/200 VUs  1m20.0s/4m30s  11.67 iters/s

running (1m21.0s), 131/200 VUs, 697 complete and 0 interrupted iterations
signup   [  30% ] 131/200 VUs  1m21.0s/4m30s  11.75 iters/s

running (1m22.0s), 130/200 VUs, 709 complete and 0 interrupted iterations
signup   [  30% ] 130/200 VUs  1m22.0s/4m30s  11.83 iters/s

running (1m23.0s), 133/200 VUs, 718 complete and 0 interrupted iterations
signup   [  31% ] 133/200 VUs  1m23.0s/4m30s  11.91 iters/s

running (1m24.0s), 131/200 VUs, 732 complete and 0 interrupted iterations
signup   [  31% ] 131/200 VUs  1m24.0s/4m30s  12.00 iters/s

running (1m25.0s), 129/200 VUs, 746 complete and 0 interrupted iterations
signup   [  31% ] 129/200 VUs  1m25.0s/4m30s  12.08 iters/s

running (1m26.0s), 129/200 VUs, 758 complete and 0 interrupted iterations
signup   [  32% ] 129/200 VUs  1m26.0s/4m30s  12.16 iters/s

running (1m27.0s), 132/200 VUs, 768 complete and 0 interrupted iterations
signup   [  32% ] 132/200 VUs  1m27.0s/4m30s  12.25 iters/s

running (1m28.0s), 136/200 VUs, 776 complete and 0 interrupted iterations
signup   [  33% ] 136/200 VUs  1m28.0s/4m30s  12.33 iters/s

running (1m29.0s), 131/200 VUs, 793 complete and 0 interrupted iterations
signup   [  33% ] 131/200 VUs  1m29.0s/4m30s  12.41 iters/s

running (1m30.0s), 134/200 VUs, 803 complete and 0 interrupted iterations
signup   [  33% ] 134/200 VUs  1m30.0s/4m30s  12.50 iters/s

running (1m31.0s), 138/200 VUs, 811 complete and 0 interrupted iterations
signup   [  34% ] 138/200 VUs  1m31.0s/4m30s  12.58 iters/s

running (1m32.0s), 136/200 VUs, 826 complete and 0 interrupted iterations
signup   [  34% ] 136/200 VUs  1m32.0s/4m30s  12.67 iters/s

running (1m33.0s), 137/200 VUs, 838 complete and 0 interrupted iterations
signup   [  34% ] 137/200 VUs  1m33.0s/4m30s  12.75 iters/s

running (1m34.0s), 137/200 VUs, 850 complete and 0 interrupted iterations
signup   [  35% ] 137/200 VUs  1m34.0s/4m30s  12.83 iters/s

running (1m35.0s), 140/200 VUs, 860 complete and 0 interrupted iterations
signup   [  35% ] 140/200 VUs  1m35.0s/4m30s  12.91 iters/s

running (1m36.0s), 136/200 VUs, 877 complete and 0 interrupted iterations
signup   [  36% ] 136/200 VUs  1m36.0s/4m30s  13.00 iters/s

running (1m37.0s), 140/200 VUs, 886 complete and 0 interrupted iterations
signup   [  36% ] 140/200 VUs  1m37.0s/4m30s  13.08 iters/s

running (1m38.0s), 140/200 VUs, 899 complete and 0 interrupted iterations
signup   [  36% ] 140/200 VUs  1m38.0s/4m30s  13.16 iters/s

running (1m39.0s), 141/200 VUs, 912 complete and 0 interrupted iterations
signup   [  37% ] 141/200 VUs  1m39.0s/4m30s  13.25 iters/s

running (1m40.0s), 141/200 VUs, 925 complete and 0 interrupted iterations
signup   [  37% ] 141/200 VUs  1m40.0s/4m30s  13.33 iters/s

running (1m41.0s), 147/200 VUs, 932 complete and 0 interrupted iterations
signup   [  37% ] 147/200 VUs  1m41.0s/4m30s  13.41 iters/s

running (1m42.0s), 147/200 VUs, 946 complete and 0 interrupted iterations
signup   [  38% ] 147/200 VUs  1m42.0s/4m30s  13.50 iters/s

running (1m43.0s), 142/200 VUs, 964 complete and 0 interrupted iterations
signup   [  38% ] 142/200 VUs  1m43.0s/4m30s  13.58 iters/s

running (1m44.0s), 144/200 VUs, 976 complete and 0 interrupted iterations
signup   [  39% ] 144/200 VUs  1m44.0s/4m30s  13.67 iters/s

running (1m45.0s), 145/200 VUs, 989 complete and 0 interrupted iterations
signup   [  39% ] 145/200 VUs  1m45.0s/4m30s  13.75 iters/s

running (1m46.0s), 146/200 VUs, 1001 complete and 0 interrupted iterations
signup   [  39% ] 146/200 VUs  1m46.0s/4m30s  13.83 iters/s

running (1m47.0s), 149/200 VUs, 1012 complete and 0 interrupted iterations
signup   [  40% ] 149/200 VUs  1m47.0s/4m30s  13.91 iters/s

running (1m48.0s), 156/200 VUs, 1019 complete and 0 interrupted iterations
signup   [  40% ] 156/200 VUs  1m48.0s/4m30s  14.00 iters/s

running (1m49.0s), 153/200 VUs, 1036 complete and 0 interrupted iterations
signup   [  40% ] 153/200 VUs  1m49.0s/4m30s  14.08 iters/s

running (1m50.0s), 148/200 VUs, 1055 complete and 0 interrupted iterations
signup   [  41% ] 148/200 VUs  1m50.0s/4m30s  14.16 iters/s

running (1m51.0s), 158/200 VUs, 1060 complete and 0 interrupted iterations
signup   [  41% ] 158/200 VUs  1m51.0s/4m30s  14.25 iters/s

running (1m52.0s), 154/200 VUs, 1078 complete and 0 interrupted iterations
signup   [  41% ] 154/200 VUs  1m52.0s/4m30s  14.33 iters/s

running (1m53.0s), 159/200 VUs, 1087 complete and 0 interrupted iterations
signup   [  42% ] 159/200 VUs  1m53.0s/4m30s  14.41 iters/s

running (1m54.0s), 157/200 VUs, 1104 complete and 0 interrupted iterations
signup   [  42% ] 157/200 VUs  1m54.0s/4m30s  14.50 iters/s

running (1m55.0s), 161/200 VUs, 1114 complete and 0 interrupted iterations
signup   [  43% ] 161/200 VUs  1m55.0s/4m30s  14.58 iters/s

running (1m56.0s), 161/200 VUs, 1129 complete and 0 interrupted iterations
signup   [  43% ] 161/200 VUs  1m56.0s/4m30s  14.67 iters/s

running (1m57.0s), 163/200 VUs, 1142 complete and 0 interrupted iterations
signup   [  43% ] 163/200 VUs  1m57.0s/4m30s  14.75 iters/s

running (1m58.0s), 163/200 VUs, 1156 complete and 0 interrupted iterations
signup   [  44% ] 163/200 VUs  1m58.0s/4m30s  14.83 iters/s

running (1m59.0s), 162/200 VUs, 1172 complete and 0 interrupted iterations
signup   [  44% ] 162/200 VUs  1m59.0s/4m30s  14.91 iters/s

running (2m00.0s), 161/200 VUs, 1188 complete and 0 interrupted iterations
signup   [  44% ] 161/200 VUs  2m00.0s/4m30s  15.00 iters/s

running (2m01.0s), 159/200 VUs, 1205 complete and 0 interrupted iterations
signup   [  45% ] 159/200 VUs  2m01.0s/4m30s  15.08 iters/s

running (2m02.0s), 163/200 VUs, 1216 complete and 0 interrupted iterations
signup   [  45% ] 163/200 VUs  2m02.0s/4m30s  15.16 iters/s

running (2m03.0s), 166/200 VUs, 1229 complete and 0 interrupted iterations
signup   [  46% ] 166/200 VUs  2m03.0s/4m30s  15.25 iters/s

running (2m04.0s), 169/200 VUs, 1241 complete and 0 interrupted iterations
signup   [  46% ] 169/200 VUs  2m04.0s/4m30s  15.33 iters/s

running (2m05.0s), 162/200 VUs, 1263 complete and 0 interrupted iterations
signup   [  46% ] 162/200 VUs  2m05.0s/4m30s  15.41 iters/s

running (2m06.0s), 167/200 VUs, 1274 complete and 0 interrupted iterations
signup   [  47% ] 167/200 VUs  2m06.0s/4m30s  15.50 iters/s

running (2m07.0s), 170/200 VUs, 1286 complete and 0 interrupted iterations
signup   [  47% ] 170/200 VUs  2m07.0s/4m30s  15.58 iters/s

running (2m08.0s), 168/200 VUs, 1304 complete and 0 interrupted iterations
signup   [  47% ] 168/200 VUs  2m08.0s/4m30s  15.67 iters/s

running (2m09.0s), 172/200 VUs, 1316 complete and 0 interrupted iterations
signup   [  48% ] 172/200 VUs  2m09.0s/4m30s  15.75 iters/s

running (2m10.0s), 166/200 VUs, 1337 complete and 0 interrupted iterations
signup   [  48% ] 166/200 VUs  2m10.0s/4m30s  15.83 iters/s

running (2m11.0s), 170/200 VUs, 1349 complete and 0 interrupted iterations
signup   [  49% ] 170/200 VUs  2m11.0s/4m30s  15.91 iters/s

running (2m12.0s), 173/200 VUs, 1362 complete and 0 interrupted iterations
signup   [  49% ] 173/200 VUs  2m12.0s/4m30s  16.00 iters/s

running (2m13.0s), 172/200 VUs, 1379 complete and 0 interrupted iterations
signup   [  49% ] 172/200 VUs  2m13.0s/4m30s  16.08 iters/s

running (2m14.0s), 177/200 VUs, 1390 complete and 0 interrupted iterations
signup   [  50% ] 177/200 VUs  2m14.0s/4m30s  16.16 iters/s

running (2m15.0s), 175/200 VUs, 1409 complete and 0 interrupted iterations
signup   [  50% ] 175/200 VUs  2m15.0s/4m30s  16.25 iters/s

running (2m16.0s), 181/200 VUs, 1419 complete and 0 interrupted iterations
signup   [  50% ] 181/200 VUs  2m16.0s/4m30s  16.33 iters/s

running (2m17.0s), 175/200 VUs, 1441 complete and 0 interrupted iterations
signup   [  51% ] 175/200 VUs  2m17.0s/4m30s  16.41 iters/s

running (2m18.0s), 178/200 VUs, 1455 complete and 0 interrupted iterations
signup   [  51% ] 178/200 VUs  2m18.0s/4m30s  16.50 iters/s

running (2m19.0s), 185/200 VUs, 1464 complete and 0 interrupted iterations
signup   [  51% ] 185/200 VUs  2m19.0s/4m30s  16.58 iters/s

running (2m20.0s), 181/200 VUs, 1485 complete and 0 interrupted iterations
signup   [  52% ] 181/200 VUs  2m20.0s/4m30s  16.67 iters/s

running (2m21.0s), 181/200 VUs, 1502 complete and 0 interrupted iterations
signup   [  52% ] 181/200 VUs  2m21.0s/4m30s  16.75 iters/s

running (2m22.0s), 182/200 VUs, 1517 complete and 0 interrupted iterations
signup   [  53% ] 182/200 VUs  2m22.0s/4m30s  16.83 iters/s

running (2m23.0s), 187/200 VUs, 1529 complete and 0 interrupted iterations
signup   [  53% ] 187/200 VUs  2m23.0s/4m30s  16.91 iters/s

running (2m24.0s), 190/200 VUs, 1543 complete and 0 interrupted iterations
signup   [  53% ] 190/200 VUs  2m24.0s/4m30s  17.00 iters/s

running (2m25.0s), 188/200 VUs, 1562 complete and 0 interrupted iterations
signup   [  54% ] 188/200 VUs  2m25.0s/4m30s  17.08 iters/s

running (2m26.0s), 187/200 VUs, 1580 complete and 0 interrupted iterations
signup   [  54% ] 187/200 VUs  2m26.0s/4m30s  17.16 iters/s

running (2m27.0s), 193/200 VUs, 1592 complete and 0 interrupted iterations
signup   [  54% ] 193/200 VUs  2m27.0s/4m30s  17.25 iters/s

running (2m28.0s), 189/200 VUs, 1613 complete and 0 interrupted iterations
signup   [  55% ] 189/200 VUs  2m28.0s/4m30s  17.33 iters/s

running (2m29.0s), 192/200 VUs, 1627 complete and 0 interrupted iterations
signup   [  55% ] 192/200 VUs  2m29.0s/4m30s  17.41 iters/s

running (2m30.0s), 192/200 VUs, 1645 complete and 0 interrupted iterations
signup   [  56% ] 192/200 VUs  2m30.0s/4m30s  17.50 iters/s

running (2m31.0s), 189/200 VUs, 1665 complete and 0 interrupted iterations
signup   [  56% ] 189/200 VUs  2m31.0s/4m30s  17.58 iters/s

running (2m32.0s), 195/200 VUs, 1677 complete and 0 interrupted iterations
signup   [  56% ] 195/200 VUs  2m32.0s/4m30s  17.67 iters/s

running (2m33.0s), 196/200 VUs, 1693 complete and 0 interrupted iterations
signup   [  57% ] 196/200 VUs  2m33.0s/4m30s  17.75 iters/s

running (2m34.0s), 200/201 VUs, 1706 complete and 0 interrupted iterations
signup   [  57% ] 200/201 VUs  2m34.0s/4m30s  17.83 iters/s

running (2m35.0s), 199/202 VUs, 1724 complete and 0 interrupted iterations
signup   [  57% ] 199/202 VUs  2m35.0s/4m30s  17.91 iters/s

running (2m36.0s), 194/202 VUs, 1747 complete and 0 interrupted iterations
signup   [  58% ] 194/202 VUs  2m36.0s/4m30s  18.00 iters/s

running (2m37.0s), 193/202 VUs, 1766 complete and 0 interrupted iterations
signup   [  58% ] 193/202 VUs  2m37.0s/4m30s  18.08 iters/s

running (2m38.0s), 197/202 VUs, 1780 complete and 0 interrupted iterations
signup   [  59% ] 197/202 VUs  2m38.0s/4m30s  18.16 iters/s

running (2m39.0s), 198/203 VUs, 1796 complete and 0 interrupted iterations
signup   [  59% ] 198/203 VUs  2m39.0s/4m30s  18.25 iters/s

running (2m40.0s), 201/203 VUs, 1812 complete and 0 interrupted iterations
signup   [  59% ] 201/203 VUs  2m40.0s/4m30s  18.33 iters/s

running (2m41.0s), 197/203 VUs, 1834 complete and 0 interrupted iterations
signup   [  60% ] 197/203 VUs  2m41.0s/4m30s  18.41 iters/s

running (2m42.0s), 198/203 VUs, 1852 complete and 0 interrupted iterations
signup   [  60% ] 198/203 VUs  2m42.0s/4m30s  18.50 iters/s

running (2m43.0s), 196/203 VUs, 1872 complete and 0 interrupted iterations
signup   [  60% ] 196/203 VUs  2m43.0s/4m30s  18.58 iters/s

running (2m44.0s), 199/203 VUs, 1888 complete and 0 interrupted iterations
signup   [  61% ] 199/203 VUs  2m44.0s/4m30s  18.67 iters/s

running (2m45.0s), 204/204 VUs, 1900 complete and 0 interrupted iterations
signup   [  61% ] 204/204 VUs  2m45.0s/4m30s  18.75 iters/s

running (2m46.0s), 205/206 VUs, 1916 complete and 0 interrupted iterations
signup   [  61% ] 205/206 VUs  2m46.0s/4m30s  18.83 iters/s

running (2m47.0s), 203/206 VUs, 1937 complete and 0 interrupted iterations
signup   [  62% ] 203/206 VUs  2m47.0s/4m30s  18.91 iters/s

running (2m48.0s), 202/206 VUs, 1957 complete and 0 interrupted iterations
signup   [  62% ] 202/206 VUs  2m48.0s/4m30s  19.00 iters/s

running (2m49.0s), 204/208 VUs, 1972 complete and 0 interrupted iterations
signup   [  63% ] 204/208 VUs  2m49.0s/4m30s  19.08 iters/s

running (2m50.0s), 204/210 VUs, 1989 complete and 0 interrupted iterations
signup   [  63% ] 204/210 VUs  2m50.0s/4m30s  19.16 iters/s

running (2m51.0s), 206/210 VUs, 2006 complete and 0 interrupted iterations
signup   [  63% ] 206/210 VUs  2m51.0s/4m30s  19.25 iters/s

running (2m52.0s), 206/210 VUs, 2026 complete and 0 interrupted iterations
signup   [  64% ] 206/210 VUs  2m52.0s/4m30s  19.33 iters/s

running (2m53.0s), 206/210 VUs, 2045 complete and 0 interrupted iterations
signup   [  64% ] 206/210 VUs  2m53.0s/4m30s  19.41 iters/s

running (2m54.0s), 204/210 VUs, 2067 complete and 0 interrupted iterations
signup   [  64% ] 204/210 VUs  2m54.0s/4m30s  19.50 iters/s

running (2m55.0s), 210/211 VUs, 2079 complete and 0 interrupted iterations
signup   [  65% ] 210/211 VUs  2m55.0s/4m30s  19.58 iters/s

running (2m56.0s), 213/213 VUs, 2094 complete and 0 interrupted iterations
signup   [  65% ] 213/213 VUs  2m56.0s/4m30s  19.67 iters/s

running (2m57.0s), 208/213 VUs, 2118 complete and 0 interrupted iterations
signup   [  66% ] 208/213 VUs  2m57.0s/4m30s  19.75 iters/s

running (2m58.0s), 208/213 VUs, 2138 complete and 0 interrupted iterations
signup   [  66% ] 208/213 VUs  2m58.0s/4m30s  19.83 iters/s

running (2m59.0s), 212/213 VUs, 2154 complete and 0 interrupted iterations
signup   [  66% ] 212/213 VUs  2m59.0s/4m30s  19.91 iters/s

running (3m00.0s), 212/213 VUs, 2174 complete and 0 interrupted iterations
signup   [  67% ] 212/213 VUs  3m00.0s/4m30s  20.00 iters/s

running (3m01.0s), 216/216 VUs, 2187 complete and 0 interrupted iterations
signup   [  67% ] 216/216 VUs  3m01.0s/4m30s  20.11 iters/s

running (3m02.0s), 218/219 VUs, 2202 complete and 0 interrupted iterations
signup   [  67% ] 218/219 VUs  3m02.0s/4m30s  20.22 iters/s

running (3m03.0s), 217/220 VUs, 2223 complete and 0 interrupted iterations
signup   [  68% ] 217/220 VUs  3m03.0s/4m30s  20.33 iters/s

running (3m04.0s), 223/223 VUs, 2234 complete and 0 interrupted iterations
signup   [  68% ] 223/223 VUs  3m04.0s/4m30s  20.44 iters/s

running (3m05.0s), 207/224 VUs, 2269 complete and 0 interrupted iterations
signup   [  69% ] 207/224 VUs  3m05.0s/4m30s  20.55 iters/s

running (3m06.0s), 211/224 VUs, 2286 complete and 0 interrupted iterations
signup   [  69% ] 211/224 VUs  3m06.0s/4m30s  20.66 iters/s

running (3m07.0s), 217/224 VUs, 2301 complete and 0 interrupted iterations
signup   [  69% ] 217/224 VUs  3m07.0s/4m30s  20.78 iters/s

running (3m08.0s), 219/224 VUs, 2320 complete and 0 interrupted iterations
signup   [  70% ] 219/224 VUs  3m08.0s/4m30s  20.89 iters/s

running (3m09.0s), 216/224 VUs, 2344 complete and 0 interrupted iterations
signup   [  70% ] 216/224 VUs  3m09.0s/4m30s  21.00 iters/s

running (3m10.0s), 222/224 VUs, 2359 complete and 0 interrupted iterations
signup   [  70% ] 222/224 VUs  3m10.0s/4m30s  21.11 iters/s

running (3m11.0s), 221/224 VUs, 2381 complete and 0 interrupted iterations
signup   [  71% ] 221/224 VUs  3m11.0s/4m30s  21.22 iters/s

running (3m12.0s), 222/224 VUs, 2401 complete and 0 interrupted iterations
signup   [  71% ] 222/224 VUs  3m12.0s/4m30s  21.33 iters/s

running (3m13.0s), 226/228 VUs, 2414 complete and 0 interrupted iterations
signup   [  71% ] 226/228 VUs  3m13.0s/4m30s  21.44 iters/s

running (3m14.0s), 230/232 VUs, 2428 complete and 0 interrupted iterations
signup   [  72% ] 230/232 VUs  3m14.0s/4m30s  21.55 iters/s

running (3m15.0s), 231/236 VUs, 2445 complete and 0 interrupted iterations
signup   [  72% ] 231/236 VUs  3m15.0s/4m30s  21.67 iters/s

running (3m16.0s), 230/236 VUs, 2467 complete and 0 interrupted iterations
signup   [  73% ] 230/236 VUs  3m16.0s/4m30s  21.77 iters/s

running (3m17.0s), 229/236 VUs, 2490 complete and 0 interrupted iterations
signup   [  73% ] 229/236 VUs  3m17.0s/4m30s  21.89 iters/s

running (3m18.0s), 237/237 VUs, 2503 complete and 0 interrupted iterations
signup   [  73% ] 237/237 VUs  3m18.0s/4m30s  22.00 iters/s

running (3m19.0s), 236/240 VUs, 2523 complete and 0 interrupted iterations
signup   [  74% ] 236/240 VUs  3m19.0s/4m30s  22.11 iters/s

running (3m20.0s), 240/246 VUs, 2535 complete and 0 interrupted iterations
signup   [  74% ] 240/246 VUs  3m20.0s/4m30s  22.22 iters/s

running (3m21.0s), 241/246 VUs, 2557 complete and 0 interrupted iterations
signup   [  74% ] 241/246 VUs  3m21.0s/4m30s  22.33 iters/s

running (3m22.0s), 243/246 VUs, 2577 complete and 0 interrupted iterations
signup   [  75% ] 243/246 VUs  3m22.0s/4m30s  22.44 iters/s

running (3m23.0s), 240/247 VUs, 2601 complete and 0 interrupted iterations
signup   [  75% ] 240/247 VUs  3m23.0s/4m30s  22.55 iters/s

running (3m24.0s), 242/247 VUs, 2622 complete and 0 interrupted iterations
signup   [  76% ] 242/247 VUs  3m24.0s/4m30s  22.66 iters/s

running (3m25.0s), 246/247 VUs, 2641 complete and 0 interrupted iterations
signup   [  76% ] 246/247 VUs  3m25.0s/4m30s  22.78 iters/s

running (3m26.0s), 245/252 VUs, 2660 complete and 0 interrupted iterations
signup   [  76% ] 245/252 VUs  3m26.0s/4m30s  22.89 iters/s

running (3m27.0s), 246/252 VUs, 2682 complete and 0 interrupted iterations
signup   [  77% ] 246/252 VUs  3m27.0s/4m30s  23.00 iters/s

running (3m28.0s), 251/252 VUs, 2700 complete and 0 interrupted iterations
signup   [  77% ] 251/252 VUs  3m28.0s/4m30s  23.11 iters/s

running (3m29.0s), 252/252 VUs, 2722 complete and 0 interrupted iterations
signup   [  77% ] 252/252 VUs  3m29.0s/4m30s  23.22 iters/s

running (3m30.0s), 255/256 VUs, 2738 complete and 0 interrupted iterations
signup   [  78% ] 255/256 VUs  3m30.0s/4m30s  23.33 iters/s

running (3m31.0s), 255/260 VUs, 2757 complete and 0 interrupted iterations
signup   [  78% ] 255/260 VUs  3m31.0s/4m30s  23.44 iters/s

running (3m32.0s), 259/261 VUs, 2776 complete and 0 interrupted iterations
signup   [  79% ] 259/261 VUs  3m32.0s/4m30s  23.55 iters/s

running (3m33.0s), 261/263 VUs, 2795 complete and 0 interrupted iterations
signup   [  79% ] 261/263 VUs  3m33.0s/4m30s  23.67 iters/s

running (3m34.0s), 258/263 VUs, 2822 complete and 0 interrupted iterations
signup   [  79% ] 258/263 VUs  3m34.0s/4m30s  23.77 iters/s

running (3m35.0s), 257/263 VUs, 2847 complete and 0 interrupted iterations
signup   [  80% ] 257/263 VUs  3m35.0s/4m30s  23.89 iters/s

running (3m36.0s), 263/267 VUs, 2861 complete and 0 interrupted iterations
signup   [  80% ] 263/267 VUs  3m36.0s/4m30s  24.00 iters/s

running (3m37.0s), 264/269 VUs, 2882 complete and 0 interrupted iterations
signup   [  80% ] 264/269 VUs  3m37.0s/4m30s  24.11 iters/s

running (3m38.0s), 267/269 VUs, 2903 complete and 0 interrupted iterations
signup   [  81% ] 267/269 VUs  3m38.0s/4m30s  24.22 iters/s

running (3m39.0s), 266/270 VUs, 2927 complete and 0 interrupted iterations
signup   [  81% ] 266/270 VUs  3m39.0s/4m30s  24.33 iters/s

running (3m40.0s), 269/270 VUs, 2949 complete and 0 interrupted iterations
signup   [  81% ] 269/270 VUs  3m40.0s/4m30s  24.44 iters/s

running (3m41.0s), 274/277 VUs, 2961 complete and 0 interrupted iterations
signup   [  82% ] 274/277 VUs  3m41.0s/4m30s  24.55 iters/s

running (3m42.0s), 274/277 VUs, 2986 complete and 0 interrupted iterations
signup   [  82% ] 274/277 VUs  3m42.0s/4m30s  24.66 iters/s

running (3m43.0s), 278/280 VUs, 3004 complete and 0 interrupted iterations
signup   [  83% ] 278/280 VUs  3m43.0s/4m30s  24.78 iters/s

running (3m44.0s), 281/281 VUs, 3025 complete and 0 interrupted iterations
signup   [  83% ] 281/281 VUs  3m44.0s/4m30s  24.89 iters/s

running (3m45.0s), 280/284 VUs, 3047 complete and 0 interrupted iterations
signup   [  83% ] 280/284 VUs  3m45.0s/4m30s  25.00 iters/s

running (3m46.0s), 291/291 VUs, 3055 complete and 0 interrupted iterations
signup   [  84% ] 291/291 VUs  3m46.0s/4m30s  25.11 iters/s

running (3m47.0s), 301/301 VUs, 3060 complete and 0 interrupted iterations
signup   [  84% ] 301/301 VUs  3m47.0s/4m30s  25.22 iters/s

running (3m48.0s), 292/304 VUs, 3091 complete and 0 interrupted iterations
signup   [  84% ] 292/304 VUs  3m48.0s/4m30s  25.33 iters/s

running (3m49.0s), 309/310 VUs, 3093 complete and 0 interrupted iterations
signup   [  85% ] 309/310 VUs  3m49.0s/4m30s  25.44 iters/s

running (3m50.0s), 312/312 VUs, 3114 complete and 0 interrupted iterations
signup   [  85% ] 312/312 VUs  3m50.0s/4m30s  25.55 iters/s

running (3m51.0s), 308/314 VUs, 3141 complete and 0 interrupted iterations
signup   [  86% ] 308/314 VUs  3m51.0s/4m30s  25.66 iters/s

running (3m52.0s), 316/318 VUs, 3155 complete and 0 interrupted iterations
signup   [  86% ] 316/318 VUs  3m52.0s/4m30s  25.77 iters/s

running (3m53.0s), 320/323 VUs, 3172 complete and 0 interrupted iterations
signup   [  86% ] 320/323 VUs  3m53.0s/4m30s  25.89 iters/s

running (3m54.0s), 329/330 VUs, 3182 complete and 0 interrupted iterations
signup   [  87% ] 329/330 VUs  3m54.0s/4m30s  26.00 iters/s

running (3m55.0s), 335/336 VUs, 3196 complete and 0 interrupted iterations
signup   [  87% ] 335/336 VUs  3m55.0s/4m30s  26.11 iters/s

running (3m56.0s), 345/345 VUs, 3203 complete and 0 interrupted iterations
signup   [  87% ] 345/345 VUs  3m56.0s/4m30s  26.22 iters/s

running (3m57.0s), 350/351 VUs, 3218 complete and 0 interrupted iterations
signup   [  88% ] 350/351 VUs  3m57.0s/4m30s  26.33 iters/s

running (3m58.0s), 337/354 VUs, 3255 complete and 0 interrupted iterations
signup   [  88% ] 337/354 VUs  3m58.0s/4m30s  26.44 iters/s

running (3m59.0s), 354/355 VUs, 3263 complete and 0 interrupted iterations
signup   [  89% ] 354/355 VUs  3m59.0s/4m30s  26.55 iters/s

running (4m00.0s), 364/364 VUs, 3271 complete and 0 interrupted iterations
signup   [  89% ] 364/364 VUs  4m00.0s/4m30s  26.66 iters/s

running (4m01.0s), 370/370 VUs, 3285 complete and 0 interrupted iterations
signup   [  89% ] 370/370 VUs  4m01.0s/4m30s  25.80 iters/s

running (4m02.0s), 379/380 VUs, 3292 complete and 0 interrupted iterations
signup   [  90% ] 379/380 VUs  4m02.0s/4m30s  24.89 iters/s

running (4m03.0s), 386/387 VUs, 3302 complete and 0 interrupted iterations
signup   [  90% ] 386/387 VUs  4m03.0s/4m30s  24.02 iters/s

running (4m04.0s), 384/387 VUs, 3328 complete and 0 interrupted iterations
signup   [  90% ] 384/387 VUs  4m04.0s/4m30s  23.11 iters/s

running (4m05.0s), 389/391 VUs, 3341 complete and 0 interrupted iterations
signup   [  91% ] 389/391 VUs  4m05.0s/4m30s  22.25 iters/s

running (4m06.0s), 390/393 VUs, 3360 complete and 0 interrupted iterations
signup   [  91% ] 390/393 VUs  4m06.0s/4m30s  21.35 iters/s

running (4m07.0s), 392/394 VUs, 3378 complete and 0 interrupted iterations
signup   [  91% ] 392/394 VUs  4m07.0s/4m30s  20.46 iters/s

running (4m08.0s), 384/396 VUs, 3404 complete and 0 interrupted iterations
signup   [  92% ] 384/396 VUs  4m08.0s/4m30s  19.57 iters/s

running (4m09.0s), 388/396 VUs, 3419 complete and 0 interrupted iterations
signup   [  92% ] 388/396 VUs  4m09.0s/4m30s  18.69 iters/s

running (4m10.0s), 387/396 VUs, 3438 complete and 0 interrupted iterations
signup   [  93% ] 387/396 VUs  4m10.0s/4m30s  17.81 iters/s

running (4m11.0s), 387/396 VUs, 3456 complete and 0 interrupted iterations
signup   [  93% ] 387/396 VUs  4m11.0s/4m30s  16.89 iters/s

running (4m12.0s), 387/396 VUs, 3472 complete and 0 interrupted iterations
signup   [  93% ] 387/396 VUs  4m12.0s/4m30s  16.03 iters/s

running (4m13.0s), 385/396 VUs, 3490 complete and 0 interrupted iterations
signup   [  94% ] 385/396 VUs  4m13.0s/4m30s  15.11 iters/s

running (4m14.0s), 384/396 VUs, 3505 complete and 0 interrupted iterations
signup   [  94% ] 384/396 VUs  4m14.0s/4m30s  14.27 iters/s

running (4m15.0s), 370/396 VUs, 3533 complete and 0 interrupted iterations
signup   [  94% ] 370/396 VUs  4m15.0s/4m30s  13.37 iters/s

running (4m16.0s), 372/396 VUs, 3544 complete and 0 interrupted iterations
signup   [  95% ] 372/396 VUs  4m16.0s/4m30s  12.47 iters/s

running (4m17.0s), 356/396 VUs, 3572 complete and 0 interrupted iterations
signup   [  95% ] 356/396 VUs  4m17.0s/4m30s  11.59 iters/s

running (4m18.0s), 357/396 VUs, 3582 complete and 0 interrupted iterations
signup   [  96% ] 357/396 VUs  4m18.0s/4m30s  10.71 iters/s

running (4m19.0s), 354/396 VUs, 3596 complete and 0 interrupted iterations
signup   [  96% ] 354/396 VUs  4m19.0s/4m30s  09.75 iters/s

running (4m20.0s), 346/396 VUs, 3613 complete and 0 interrupted iterations
signup   [  96% ] 346/396 VUs  4m20.0s/4m30s  08.89 iters/s

running (4m21.0s), 331/396 VUs, 3636 complete and 0 interrupted iterations
signup   [  97% ] 331/396 VUs  4m21.0s/4m30s  08.06 iters/s

running (4m22.0s), 312/396 VUs, 3663 complete and 0 interrupted iterations
signup   [  97% ] 312/396 VUs  4m22.0s/4m30s  07.12 iters/s

running (4m23.0s), 306/396 VUs, 3676 complete and 0 interrupted iterations
signup   [  97% ] 306/396 VUs  4m23.0s/4m30s  06.18 iters/s

running (4m24.0s), 295/396 VUs, 3692 complete and 0 interrupted iterations
signup   [  98% ] 295/396 VUs  4m24.0s/4m30s  05.42 iters/s

running (4m25.0s), 251/396 VUs, 3741 complete and 0 interrupted iterations
signup   [  98% ] 251/396 VUs  4m25.0s/4m30s  04.52 iters/s

running (4m26.0s), 221/396 VUs, 3775 complete and 0 interrupted iterations
signup   [  99% ] 221/396 VUs  4m26.0s/4m30s  03.65 iters/s

running (4m27.0s), 191/396 VUs, 3808 complete and 0 interrupted iterations
signup   [  99% ] 191/396 VUs  4m27.0s/4m30s  02.82 iters/s

running (4m28.0s), 155/396 VUs, 3847 complete and 0 interrupted iterations
signup   [  99% ] 155/396 VUs  4m28.0s/4m30s  01.61 iters/s

running (4m29.0s), 116/396 VUs, 3887 complete and 0 interrupted iterations
signup   [ 100% ] 116/396 VUs  4m29.0s/4m30s  00.67 iters/s

running (4m30.0s), 091/396 VUs, 3912 complete and 0 interrupted iterations
signup   [ 100% ] 091/396 VUs  4m30.0s/4m30s  00.67 iters/s

running (4m31.0s), 067/396 VUs, 3936 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m32.0s), 049/396 VUs, 3954 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m33.0s), 033/396 VUs, 3970 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m34.0s), 028/396 VUs, 3975 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m35.0s), 020/396 VUs, 3983 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m36.0s), 015/396 VUs, 3988 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m37.0s), 010/396 VUs, 3993 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m38.0s), 007/396 VUs, 3996 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s

running (4m39.0s), 001/396 VUs, 4002 complete and 0 interrupted iterations
signup ↓ [ 100% ] 090/396 VUs  4m30s  00.67 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=1.45s
    ✗ 'p(99)<1000' p(99)=2.9s

      {name:/onboarding/complete}
      ✗ 'p(95)<700' p(95)=2.66s

      {name:/onboarding/recommendations}
      ✗ 'p(95)<800' p(95)=2.89s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 36566   130.825952/s
    checks_succeeded...: 100.00% 36566 out of 36566
    checks_failed......: 0.00%   0 out of 36566

    ✓ state → 200
    ✓ topics → 200
    ✓ interests → 200
    ✓ career → 200
    ✓ recommendations → 200
    ✓ complete → 200
    ✓ complete → onboarding_completed
    ✓ first-drip → 200
    ✓ first drip settled within 15s

    CUSTOM
    ear_complete_latency.....................: avg=554.62ms min=21ms    med=76ms    max=3.57s  p(90)=2.41s    p(95)=2.66s 
    ear_domain_errors........................: 0.00%  0 out of 20554
    ear_first_drip_status....................: 4003   14.321946/s
    ear_first_drip_wait......................: avg=1.89s    min=1.03s   med=1.1s    max=6.59s  p(90)=5.53s    p(95)=5.91s 
    ear_signups_completed....................: 4003   14.321946/s

    HTTP
    http_req_duration........................: avg=241.57ms min=6.84ms  med=34.11ms max=3.77s  p(90)=545.72ms p(95)=1.45s 
      { expected_response:true }.............: avg=241.57ms min=6.84ms  med=34.11ms max=3.77s  p(90)=545.72ms p(95)=1.45s 
      { name:/onboarding/complete }..........: avg=554.44ms min=20.88ms med=76.15ms max=3.57s  p(90)=2.41s    p(95)=2.66s 
      { name:/onboarding/recommendations }...: avg=577.73ms min=16.4ms  med=52.09ms max=3.77s  p(90)=2.62s    p(95)=2.89s 
    http_req_failed..........................: 0.00%  0 out of 28560
    http_reqs................................: 28560  102.182059/s

    EXECUTION
    dropped_iterations.......................: 196    0.701249/s
    iteration_duration.......................: avg=12.84s   min=7.05s   med=11.88s  max=23.66s p(90)=18.75s   p(95)=20.25s
    iterations...............................: 4003   14.321946/s
    vus......................................: 1      min=1          max=392
    vus_max..................................: 396    min=200        max=396

    NETWORK
    data_received............................: 34 MB  122 kB/s
    data_sent................................: 4.1 MB 15 kB/s



running (4m39.5s), 000/396 VUs, 4003 complete and 0 interrupted iterations
signup ✓ [ 100% ] 000/396 VUs  4m30s  00.67 iters/s
time="2026-09-23T18:24:21+09:00" level=error msg="thresholds on metrics 'http_req_duration, http_req_duration{name:/onboarding/complete}, http_req_duration{name:/onboarding/recommendations}' have been crossed"